In [1]:
import pandas as pd

df = pd.DataFrame({
  'name': ['Alice', 'Bob'],
  'age': [20, 32]
})

for c in df:
  print(c)

name
age

In [4]:
import pandas as pd

df = pd.DataFrame({
  'name': ['Alice', 'Bob'],
  'age': [20, 32]
})

for i in range(len(df)):
  print(df.iloc[i])

name    Alice
age        20
Name: 0, dtype: object
name    Bob
age      32
Name: 1, dtype: object

In [5]:
for d in df.iteritems():
  print(d)

for d in df.iterrows():
  print(d)

for d in df.itertuples():
  print(d)

('name', 0    Alice
1      Bob
Name: name, dtype: object)
('age', 0    20
1    32
Name: age, dtype: int64)
(0, name    Alice
age        20
Name: 0, dtype: object)
(1, name    Bob
age      32
Name: 1, dtype: object)
Pandas(Index=0, name='Alice', age=20)
Pandas(Index=1, name='Bob', age=32)

In [6]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
  'score': [98, 67, 85],
  'age': [20, 32, 28]
})

In [7]:
df

   score  age
0     98   20
1     67   32
2     85   28

In [9]:
df.apply(np.max)
# score    98
# age      32
# dtype: int64

score    98
age      32
dtype: int64

In [10]:
df.apply(np.min)
# score    67
# age      20
# dtype: int64

score    67
age      20
dtype: int64

In [11]:
df.apply(lambda x: x.max() - x.min())
# score    31
# age      12
# dtype: int64

score    31
age      12
dtype: int64

In [12]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
  'score': [98, 67, 85],
  'age': [20, 32, 28]
})

df['age'].map(lambda x: -x)

0   -20
1   -32
2   -28
Name: age, dtype: int64

In [13]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
  'score': [98, 67, 85],
  'age': [20, 32, 28]
})

df.applymap(lambda x: -x)

   score  age
0    -98  -20
1    -67  -32
2    -85  -28

In [14]:
df.apply(lambda x: x.max() - x.min())
# score    31
# age      12
# dtype: int64

score    31
age      12
dtype: int64

In [15]:
def f(x):
  return x.max() - x.min()
print(df.apply(f))
# score    31
# age      12
# dtype: int64

score    31
age      12
dtype: int64

1. 根據給定的 DataFrame 中取出索引為 3, 4, 8 的 animal 和 age 欄位

In [41]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [56]:
df.loc['a':'c',:]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [17]:
df.iloc[[3,4,8]].loc[:,['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

2. 請將 dataFrame 所有字串都變成是大寫開頭。

In [64]:
df = pd.DataFrame([
    ['tom', 'mark', 'mary'],
    ['bob', 'alice', 'john']
])
df

     0      1     2
0  tom   mark  mary
1  bob  alice  john

In [65]:
df.applymap(lambda x: x.capitalize())

     0      1     2
0  Tom   Mark  Mary
1  Bob  Alice  John

In [66]:
print(df.applymap(lambda i : str(i).title()))

     0      1     2
0  Tom   Mark  Mary
1  Bob  Alice  John